# IsBuiltInParameter Method (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ParameterUtils..::..IsBuiltInParameter Method
ParameterUtils Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsBuiltInParameter(ElementId) | Checks whether an ElementId identifies a built-in parameter. |
| IsBuiltInParameter(ForgeTypeId) | Checks whether a ForgeTypeId identifies a built-in parameter. |

# See Also
ParameterUtils Class
ParameterUtils Members
Autodesk.Revit.DB Namespace